app/controllers/cities_controller.rb

  def index

    if params[:name] || session[:search_city_name]
      session[:search_city_name] = params[:name] if params[:name]
      @cities = City.search(session[:search_city_name])
---
SELECT "cities".* FROM "cities"

  def create
    @city = City.new(city_params)
    if @city.valid?
      @city.save
---
INSERT INTO "cities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-19 01:11:19.220725"], ["name", "MEDIANEIRA, PR"], ["updated_at", "2014-10-19 01:11:19.220725"]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 4]]

    def set_city
      @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities"  WHERE "cities"."id" = ? LIMIT 1  [["id", 4]]