app/controllers/course_classes_controller.rb

  def index
    @course_classes = CourseClass.search(params[:name], params[:institution], params[:course])
---
SELECT "course_classes".* FROM "course_classes"

  def create
    @course_class = CourseClass.new(course_class_params)
    @course_class.save
---
INSERT INTO "course_classes" ("begin", "course_id", "created_at", "institution_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["begin", "2014-10-02"], ["course_id", 1], ["created_at", "2014-10-23 23:48:34.113641"], ["institution_id", 1], ["name", "teste"], ["updated_at", "2014-10-23 23:48:34.113641"]]

  def update
    @course_class.update(course_class_params)
---
UPDATE "course_classes" SET "course_id" = ?, "updated_at" = ? WHERE "course_classes"."id" = 1  [["course_id", 3], ["updated_at", "2014-10-23 23:48:44.520711"]]

  def destroy
    @course_class.destroy
---
DELETE FROM "course_classes" WHERE "course_classes"."id" = ?  [["id", 1]]

    def set_course_class
      @course_class = CourseClass.find(params[:id]) if params[:id].to_i > 0
---
SELECT  "course_classes".* FROM "course_classes"  WHERE "course_classes"."id" = ? LIMIT 1  [["id", 1]]