app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    @course.save
---
INSERT INTO "courses" ("acronym", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["acronym", "LE"], ["created_at", "2014-10-21 23:46:53.272997"], ["name", "LICENCIATURA"], ["updated_at", "2014-10-21 23:46:53.272997"]]

  def update
    @course.update(course_params)
---
UPDATE "courses" SET "acronym" = ?, "updated_at" = ? WHERE "courses"."id" = 1  [["acronym", "GP"], ["updated_at", "2014-10-21 23:46:12.559275"]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 4]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 4]]