app/controllers/institutions_controller.rb

SELECT COUNT(*) FROM "institutions"
---
  def index
    @institutions = self.search(params, Institution)
    @total = Institution.distinct.count('id')