app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"

  def create
    @institution = Institution.new(institution_params)
    @institution.save
---
INSERT INTO "institutions" ("created_at", "email", "name", "phone_number", "site", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @institution.destroy
---
DELETE FROM "institutions" WHERE "institutions"."id" = ?  [["id", 1]]

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions"  WHERE "institutions"."id" = ? LIMIT 1  [["id", 3]]