app/controllers/students_controller.rb

INSERT INTO "students" ("address", "badge_observation", "created_at", "email", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", ""], ["badge_observation", ""], ["created_at", "2014-10-18 19:02:19.284391"], ["email", ""], ["name", ""], ["phone_number", ""], ["updated_at", "2014-10-18 19:02:19.284391"]]
---
  def create
    @student = Student.new(student_params)
    @student.save

UPDATE "students" SET "badge_observation" = ?, "has_badge" = ?, "updated_at" = ? WHERE "students"."id" = 2  [["badge_observation", ""], ["has_badge", "t"], ["updated_at", "2014-10-18 23:49:39.325274"]]
---
  def update
    @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student.destroy